pandas: 파이썬의 일부라기보단 독립된 언어 같은 느낌. R의 기능을 파이썬에서 쓰기 위해 만든 것.

In [57]:
import pandas as pd
import numpy as np

In [58]:
a = [1, 2, 3]
for i in a:
  print(i)

1
2
3

In [59]:
pd.Series([1,2,3])  # 시리즈 만들기 (1이 0포지션에 있음)

0    1
1    2
2    3
dtype: int64

# TOC
1. Object Creation (객체 생성)
2. Viewing Data (데이터 확인하기)
3. Selection (선택)
4. Missing Data (결측치)

# 1. Object Creation (객체 생성)

## Series

In [60]:
s = pd.Series([1, 2, 3, 4, 5, np.nan, 8])  # np.nan : null 값 -> 이게 들어가면 컬럼 전체가 실수형(float)이 됨

In [61]:
s

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
6    8.0
dtype: float64

In [62]:
# Series s의 길이
len(s)

7

## Dataframe

In [63]:
df = pd.DataFrame({'A': 1, 
                   'B': 'String',
                   'C': s,
                   'D': pd.Series([2, 3, 4, 5, 6, 7, 8])})

In [64]:
df

   A       B    C  D
0  1  String  1.0  2
1  1  String  2.0  3
2  1  String  3.0  4
3  1  String  4.0  5
4  1  String  5.0  6
5  1  String  NaN  7
6  1  String  8.0  8

In [65]:
df2 = pd.DataFrame({'A': range(1,8),  # 연속되는 숫자 쓸 때 range(x,y)
                   'B': ['a','b','c','d','e','f','g'],
                   'C': s,
                   'D': [2, 3, 4, 5, 6, 7, 8]})
df2

   A  B    C  D
0  1  a  1.0  2
1  2  b  2.0  3
2  3  c  3.0  4
3  4  d  4.0  5
4  5  e  5.0  6
5  6  f  NaN  7
6  7  g  8.0  8

In [66]:
# DataFrame df의 길이
len(df)

7

In [67]:
df.dtypes  # float: 실수 / int: 정수

A      int64
B     object
C    float64
D      int64
dtype: object

In [68]:
df2.dtypes

A      int64
B     object
C    float64
D      int64
dtype: object

## Read data from outside

In [69]:
house_price = pd.read_csv('https://raw.githubusercontent.com/dataitgirls3/Data/master/house_price_sample.csv')

In [70]:
len(house_price)

1460

In [71]:
house_price.head()

,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities,...,PoolArea,PoolQC,Fence,MiscFeature,MiscVal,MoSold,YrSold,SaleType,SaleCondition,SalePrice
0,1,60,RL,65.0,8450,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2008,WD,Normal,208500
1,2,20,RL,80.0,9600,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,5,2007,WD,Normal,181500
2,3,60,RL,68.0,11250,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,9,2008,WD,Normal,223500
3,4,70,RL,60.0,9550,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2006,WD,Abnorml,140000
4,5,60,RL,84.0,14260,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,12,2008,WD,Normal,250000

In [72]:
# command + ? 누르면 커서가 위치한 줄 주석 처리

# 2. Viewing Data (데이터 확인하기)

## 데이터의 일부를 눈으로 확인하기

In [73]:
# df.head()
# df.head(2)
df.tail(2)

   A       B    C  D
5  1  String  NaN  7
6  1  String  8.0  8

In [74]:
house_price.tail()

,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities,...,PoolArea,PoolQC,Fence,MiscFeature,MiscVal,MoSold,YrSold,SaleType,SaleCondition,SalePrice
1455,1456,60,RL,62.0,7917,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,8,2007,WD,Normal,175000
1456,1457,20,RL,85.0,13175,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,MnPrv,NaN,0,2,2010,WD,Normal,210000
1457,1458,70,RL,66.0,9042,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,GdPrv,Shed,2500,5,2010,WD,Normal,266500
1458,1459,20,RL,68.0,9717,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,4,2010,WD,Normal,142125
1459,1460,20,RL,75.0,9937,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,6,2008,WD,Normal,147500

In [75]:
house_price.iloc[4]  # 4번째 행의 데이터만 보여줌

Id                     5
MSSubClass            60
MSZoning              RL
LotFrontage           84
LotArea            14260
Street              Pave
Alley                NaN
LotShape             IR1
LandContour          Lvl
Utilities         AllPub
LotConfig            FR2
LandSlope            Gtl
Neighborhood     NoRidge
Condition1          Norm
Condition2          Norm
BldgType            1Fam
HouseStyle        2Story
OverallQual            8
OverallCond            5
YearBuilt           2000
YearRemodAdd        2000
RoofStyle          Gable
RoofMatl         CompShg
Exterior1st      VinylSd
Exterior2nd      VinylSd
MasVnrType       BrkFace
MasVnrArea           350
ExterQual             Gd
ExterCond             TA
Foundation         PConc
                  ...
BedroomAbvGr           4
KitchenAbvGr           1
KitchenQual           Gd
TotRmsAbvGrd           9
Functional           Typ
Fireplaces             1
FireplaceQu           TA
GarageType        Attchd
GarageYrBlt         2000
GarageFinish         RFn
GarageCars             3
GarageArea           836
GarageQual            TA
GarageCond            TA
PavedDrive             Y
WoodDeckSF           192
OpenPorchSF           84
EnclosedPorch          0
3SsnPorch              0
ScreenPorch            0
PoolArea               0
PoolQC               NaN
Fence                NaN
MiscFeature          NaN
MiscVal                0
MoSold                12
YrSold              2008
SaleType              WD
SaleCondition     Normal
SalePrice         250000
Name: 4, Length: 81, dtype: object

### 데이터 프레임의 컬럼만 가져오기

In [76]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [77]:
house_price.columns

Index(['Id', 'MSSubClass', 'MSZoning', 'LotFrontage', 'LotArea', 'Street',
       'Alley', 'LotShape', 'LandContour', 'Utilities', 'LotConfig',
       'LandSlope', 'Neighborhood', 'Condition1', 'Condition2', 'BldgType',
       'HouseStyle', 'OverallQual', 'OverallCond', 'YearBuilt', 'YearRemodAdd',
       'RoofStyle', 'RoofMatl', 'Exterior1st', 'Exterior2nd', 'MasVnrType',
       'MasVnrArea', 'ExterQual', 'ExterCond', 'Foundation', 'BsmtQual',
       'BsmtCond', 'BsmtExposure', 'BsmtFinType1', 'BsmtFinSF1',
       'BsmtFinType2', 'BsmtFinSF2', 'BsmtUnfSF', 'TotalBsmtSF', 'Heating',
       'HeatingQC', 'CentralAir', 'Electrical', '1stFlrSF', '2ndFlrSF',
       'LowQualFinSF', 'GrLivArea', 'BsmtFullBath', 'BsmtHalfBath', 'FullBath',
       'HalfBath', 'BedroomAbvGr', 'KitchenAbvGr', 'KitchenQual',
       'TotRmsAbvGrd', 'Functional', 'Fireplaces', 'FireplaceQu', 'GarageType',
       'GarageYrBlt', 'GarageFinish', 'GarageCars', 'GarageArea', 'GarageQual',
       'GarageCond', 'PavedDrive', 'WoodDeckSF', 'OpenPorchSF',
       'EnclosedPorch', '3SsnPorch', 'ScreenPorch', 'PoolArea', 'PoolQC',
       'Fence', 'MiscFeature', 'MiscVal', 'MoSold', 'YrSold', 'SaleType',
       'SaleCondition', 'SalePrice'],
      dtype='object')

### 데이터 프레임의 값만 가져오기

In [78]:
df.values

array([[1, 'String', 1.0, 2],
       [1, 'String', 2.0, 3],
       [1, 'String', 3.0, 4],
       [1, 'String', 4.0, 5],
       [1, 'String', 5.0, 6],
       [1, 'String', nan, 7],
       [1, 'String', 8.0, 8]], dtype=object)

### 간단 요약통계

In [79]:
df.describe()

         A         C         D
count  7.0  6.000000  7.000000
mean   1.0  3.833333  5.000000
std    0.0  2.483277  2.160247
min    1.0  1.000000  2.000000
25%    1.0  2.250000  3.500000
50%    1.0  3.500000  5.000000
75%    1.0  4.750000  6.500000
max    1.0  8.000000  8.000000

In [80]:
house_price.describe()

,Id,MSSubClass,LotFrontage,LotArea,OverallQual,OverallCond,YearBuilt,YearRemodAdd,MasVnrArea,BsmtFinSF1,...,WoodDeckSF,OpenPorchSF,EnclosedPorch,3SsnPorch,ScreenPorch,PoolArea,MiscVal,MoSold,YrSold,SalePrice
count,1460.000000,1460.000000,1201.000000,1460.000000,1460.000000,1460.000000,1460.000000,1460.000000,1452.000000,1460.000000,...,1460.000000,1460.000000,1460.000000,1460.000000,1460.000000,1460.000000,1460.000000,1460.000000,1460.000000,1460.000000
mean,730.500000,56.897260,70.049958,10516.828082,6.099315,5.575342,1971.267808,1984.865753,103.685262,443.639726,...,94.244521,46.660274,21.954110,3.409589,15.060959,2.758904,43.489041,6.321918,2007.815753,180921.195890
std,421.610009,42.300571,24.284752,9981.264932,1.382997,1.112799,30.202904,20.645407,181.066207,456.098091,...,125.338794,66.256028,61.119149,29.317331,55.757415,40.177307,496.123024,2.703626,1.328095,79442.502883
min,1.000000,20.000000,21.000000,1300.000000,1.000000,1.000000,1872.000000,1950.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,2006.000000,34900.000000
25%,365.750000,20.000000,59.000000,7553.500000,5.000000,5.000000,1954.000000,1967.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,5.000000,2007.000000,129975.000000
50%,730.500000,50.000000,69.000000,9478.500000,6.000000,5.000000,1973.000000,1994.000000,0.000000,383.500000,...,0.000000,25.000000,0.000000,0.000000,0.000000,0.000000,0.000000,6.000000,2008.000000,163000.000000
75%,1095.250000,70.000000,80.000000,11601.500000,7.000000,6.000000,2000.000000,2004.000000,166.000000,712.250000,...,168.000000,68.000000,0.000000,0.000000,0.000000,0.000000,0.000000,8.000000,2009.000000,214000.000000
max,1460.000000,190.000000,313.000000,215245.000000,10.000000,9.000000,2010.000000,2010.000000,1600.000000,5644.000000,...,857.000000,547.000000,552.000000,508.000000,480.000000,738.000000,15500.000000,12.000000,2010.000000,755000.000000

### 데이터 프레임 전치

In [81]:
df.T  # 행,열 전환

        0       1       2       3       4       5       6
A       1       1       1       1       1       1       1
B  String  String  String  String  String  String  String
C       1       2       3       4       5     NaN       8
D       2       3       4       5       6       7       8

### 데이터 정렬하기

In [82]:
df.sort_index(axis=0, ascending=False)  # row index 기준 역순 sorting

   A       B    C  D
6  1  String  8.0  8
5  1  String  NaN  7
4  1  String  5.0  6
3  1  String  4.0  5
2  1  String  3.0  4
1  1  String  2.0  3
0  1  String  1.0  2

In [83]:
df.sort_index(axis=1, ascending=False)  # column index 기준 역순 sorting

   D    C       B  A
0  2  1.0  String  1
1  3  2.0  String  1
2  4  3.0  String  1
3  5  4.0  String  1
4  6  5.0  String  1
5  7  NaN  String  1
6  8  8.0  String  1

In [84]:
'''sql
SELECT *
FROM df
ORDER BY df.D DESC
'''

df.sort_values(by='D', ascending=False)

   A       B    C  D
6  1  String  8.0  8
5  1  String  NaN  7
4  1  String  5.0  6
3  1  String  4.0  5
2  1  String  3.0  4
1  1  String  2.0  3
0  1  String  1.0  2

In [85]:
house_price.sort_values(by='SalePrice', ascending=False).head(10)

,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities,...,PoolArea,PoolQC,Fence,MiscFeature,MiscVal,MoSold,YrSold,SaleType,SaleCondition,SalePrice
691,692,60,RL,104.0,21535,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,1,2007,WD,Normal,755000
1182,1183,60,RL,160.0,15623,Pave,NaN,IR1,Lvl,AllPub,...,555,Ex,MnPrv,NaN,0,7,2007,WD,Abnorml,745000
1169,1170,60,RL,118.0,35760,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,7,2006,WD,Normal,625000
898,899,20,RL,100.0,12919,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,3,2010,New,Partial,611657
803,804,60,RL,107.0,13891,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,1,2009,New,Partial,582933
1046,1047,60,RL,85.0,16056,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,7,2006,New,Partial,556581
440,441,20,RL,105.0,15431,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,4,2009,WD,Normal,555000
769,770,60,RL,47.0,53504,Pave,NaN,IR2,HLS,AllPub,...,0,NaN,NaN,NaN,0,6,2010,WD,Normal,538000
178,179,20,RL,63.0,17423,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,7,2009,New,Partial,501837
798,799,60,RL,104.0,13518,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,7,2009,New,Partial,485000

# 3. Selection (선택)

In [86]:
'''sql
SELECT df.C
FROM df
'''

df['C']  # 'C' 컬럼만 보기

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
6    8.0
Name: C, dtype: float64

In [87]:
# 2개 이상의 컬럼 보는 방법 1.
df[['C','D']]

     C  D
0  1.0  2
1  2.0  3
2  3.0  4
3  4.0  5
4  5.0  6
5  NaN  7
6  8.0  8

In [88]:
# 2개 이상의 컬럼 보는 방법 2.
col = ['C','D']   
df[col]

     C  D
0  1.0  2
1  2.0  3
2  3.0  4
3  4.0  5
4  5.0  6
5  NaN  7
6  8.0  8

## Selection by Label

In [89]:
# Selection by Label하고 헷갈릴 수 있으니까 index를 날짜로 바꿔주겠습니다.
# Pandas에서 날짜는 이렇게 만들 수 있습니다.

df.index = pd.date_range('20190801', periods=7)  # df의 index 바꾸기
df

            A       B    C  D
2019-08-01  1  String  1.0  2
2019-08-02  1  String  2.0  3
2019-08-03  1  String  3.0  4
2019-08-04  1  String  4.0  5
2019-08-05  1  String  5.0  6
2019-08-06  1  String  NaN  7
2019-08-07  1  String  8.0  8

In [90]:
df2.index = df2['A']
df2

   A  B    C  D
A
1  1  a  1.0  2
2  2  b  2.0  3
3  3  c  3.0  4
4  4  d  4.0  5
5  5  e  5.0  6
6  6  f  NaN  7
7  7  g  8.0  8

In [91]:
dates = df.index

In [92]:
print('dates안의 첫번째 데이터: ' + str(dates[0]))

dates안의 첫번째 데이터: 2019-08-01 00:00:00

In [93]:
'''
df.loc[index, column]
'''

# df.loc[dates[0], :]
df.loc[dates[0]]

A         1
B    String
C         1
D         2
Name: 2019-08-01 00:00:00, dtype: object

In [94]:
df.loc[2,['A','B']]  # df.loc[index,column] : 아까 index를 날짜로 바꿔서 안 먹힘

TypeError: cannot do index indexing on <class 'pandas.core.indexes.datetimes.DatetimeIndex'> with these indexers [2] of <class 'int'>

In [95]:
df.loc['2019-08-03',['A','B']]

A         1
B    String
Name: 2019-08-03 00:00:00, dtype: object

In [96]:
df.loc['20190801':'20190803', ['A', 'B']]

            A       B
2019-08-01  1  String
2019-08-02  1  String
2019-08-03  1  String

In [97]:
df.loc[dates[2:5],['C','D']]

              C  D
2019-08-03  3.0  4
2019-08-04  4.0  5
2019-08-05  5.0  6

In [98]:
df.loc[:,['A', 'B']]  # 전체 행 다 가져오기

            A       B
2019-08-01  1  String
2019-08-02  1  String
2019-08-03  1  String
2019-08-04  1  String
2019-08-05  1  String
2019-08-06  1  String
2019-08-07  1  String

In [99]:
%timeit df.loc['20190801', 'A']
# df.loc['20190801', 'A'] 을 실행하는 데 걸리는 시간 알아보기

488 µs ± 26 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [100]:
df

            A       B    C  D
2019-08-01  1  String  1.0  2
2019-08-02  1  String  2.0  3
2019-08-03  1  String  3.0  4
2019-08-04  1  String  4.0  5
2019-08-05  1  String  5.0  6
2019-08-06  1  String  NaN  7
2019-08-07  1  String  8.0  8

In [102]:
df.index

DatetimeIndex(['2019-08-01', '2019-08-02', '2019-08-03', '2019-08-04',
               '2019-08-05', '2019-08-06', '2019-08-07'],
              dtype='datetime64[ns]', freq='D')

In [104]:
df.index = df.index.astype('str')

In [105]:
df.at['2019-08-01', 'A']
# df.at :  단 하나의 값(스칼라)을 가져올 때 df.loc보다 빠름
# df.loc은 datetime 형태의 데이터를 자동으로 문자열처럼 인식해서 가져오지만 df.at에는 그런 기능이 없으므로 사전에 string 타입으로 바꿔줘야한다.

1

In [107]:
%timeit df.at['2019-08-01', 'A']

5.28 µs ± 236 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

## Selection by Position
#### loc, ac : 라벨(인덱스 이름)으로 값 찾기  ex) df.loc['20190801':'20190806',['A','B','C']]
#### iloc, iaot: 데이터 위치(인덱스 숫자)로 값 찾기  ex) df.iloc[0:2,0:3]

In [81]:
df.iloc[0]
df.iloc[1]

A         1
B    String
C         2
D         3
Name: 2019-08-02 00:00:00, dtype: object

In [82]:
df.iloc[[0, 1]]

            A       B    C  D
2019-08-01  1  String  1.0  2
2019-08-02  1  String  2.0  3

In [83]:
df.iloc[[0, 1], [0, 1]]  # 0부터 1행까지의 행, 0부터 1행까지의 열

            A       B
2019-08-01  1  String
2019-08-02  1  String

In [84]:
df.iloc[0:2, 0]

2019-08-01    1
2019-08-02    1
Freq: D, Name: A, dtype: int64

In [87]:
df.loc['20190801':'20190802',['A','B']]

            A       B
2019-08-01  1  String
2019-08-02  1  String

In [88]:
%timeit df.iloc[0, 0]
%timeit df.iat[0, 0]

8.95 µs ± 32.3 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)
5.69 µs ± 35.8 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

## Boolean Indexing

In [62]:
# Boolean Indexing 공부를 위해서 기존의 데이터프레임에 컬럼을 하나 추가 해보겠습니다.
df['F'] = ['Sydney', 'Brisbane', 'Brisbane', 'Melbourne', 'Sydney', 'Sydney', 'Sydney']

In [63]:
'''sql
SELECT *
FROM df
WHERE df.F = 'Sydney'
'''

df['F'] == 'Sydney'
# df[df['F'] == 'Sydney']

2019-08-01     True
2019-08-02    False
2019-08-03    False
2019-08-04    False
2019-08-05     True
2019-08-06     True
2019-08-07     True
Freq: D, Name: F, dtype: bool

In [64]:
'''sql
SELECT *
FROM df
WHERE df.F IN ('Sydney', 'Melbourne')
'''

df[df['F'].isin(['Sydney', 'Melbourne'])]

            A       B    C  D          F
2019-08-01  1  String  1.0  2     Sydney
2019-08-04  1  String  4.0  5  Melbourne
2019-08-05  1  String  5.0  6     Sydney
2019-08-06  1  String  NaN  7     Sydney
2019-08-07  1  String  8.0  8     Sydney

In [66]:
df[df['F'].isin(['Brisbane'])]

            A       B    C  D         F
2019-08-02  1  String  2.0  3  Brisbane
2019-08-03  1  String  3.0  4  Brisbane

In [67]:
df[df['F']=='Brisbane']

            A       B    C  D         F
2019-08-02  1  String  2.0  3  Brisbane
2019-08-03  1  String  3.0  4  Brisbane

In [68]:
'''sql
SELECT *
FROM df
WHERE df.D < 5
'''

df[df['D'] < 5]

            A       B    C  D         F
2019-08-01  1  String  1.0  2    Sydney
2019-08-02  1  String  2.0  3  Brisbane
2019-08-03  1  String  3.0  4  Brisbane

# 4. Missing Data

In [69]:
df.dropna()  # NaN 값이 있는 행 제거

            A       B    C  D          F
2019-08-01  1  String  1.0  2     Sydney
2019-08-02  1  String  2.0  3   Brisbane
2019-08-03  1  String  3.0  4   Brisbane
2019-08-04  1  String  4.0  5  Melbourne
2019-08-05  1  String  5.0  6     Sydney
2019-08-07  1  String  8.0  8     Sydney

In [70]:
df.fillna('This was null')  # NaN 값을 대치

            A       B              C  D          F
2019-08-01  1  String              1  2     Sydney
2019-08-02  1  String              2  3   Brisbane
2019-08-03  1  String              3  4   Brisbane
2019-08-04  1  String              4  5  Melbourne
2019-08-05  1  String              5  6     Sydney
2019-08-06  1  String  This was null  7     Sydney
2019-08-07  1  String              8  8     Sydney

In [71]:
df

            A       B    C  D          F
2019-08-01  1  String  1.0  2     Sydney
2019-08-02  1  String  2.0  3   Brisbane
2019-08-03  1  String  3.0  4   Brisbane
2019-08-04  1  String  4.0  5  Melbourne
2019-08-05  1  String  5.0  6     Sydney
2019-08-06  1  String  NaN  7     Sydney
2019-08-07  1  String  8.0  8     Sydney